Repository: Krupinin/recognition_of_hard_hats
Catalog: web_interface/locale/*/LC_MESSAGES/messages.po
Languages: ru

source: Hard Hat Detection
ru: Обнаружение касок

source: Hard Hat Violation Detection
ru: Обнаружение нарушений использования касок

source: Upload one or more images to check for persons without helmets.
ru: Загрузите одно или несколько изображений для проверки на наличие людей без касок.

source: Check Images
ru: Проверить изображения

source: Supported formats: PNG, JPG, JPEG, BMP
ru: Поддерживаемые форматы: PNG, JPG, JPEG, BMP

source: Multiple files can be selected for batch processing.
ru: Можно выбрать несколько файлов для пакетной обработки.

source: Language:
ru: Язык:

source: Detection Results
ru: Результаты обнаружения

source: Summary: Violations detected in
ru: Итог: Нарушения обнаружены в

source: Upload more images
ru: Загрузить больше изображений
